KeInitializeDpc

```C
VOID KeInitializeDpc(
  _Out_    PRKDPC             Dpc,
  _In_     PKDEFERRED_ROUTINE DeferredRoutine,
  _In_opt_ PVOID              DeferredContext
);
```

```
kd> dt nt!*APC*
          ntkrpamp!_KAPC
          ntkrpamp!_PSP_CPU_QUOTA_APC
          ntkrpamp!_KAPC_STATE
kd> dt ntkrpamp!_KAPC
   +0x000 Type             : UChar
   +0x001 SpareByte0       : UChar
   +0x002 Size             : UChar
   +0x003 SpareByte1       : UChar
   +0x004 SpareLong0       : Uint4B
   +0x008 Thread           : Ptr32 _KTHREAD
   +0x00c ApcListEntry     : _LIST_ENTRY
   +0x014 KernelRoutine    : Ptr32     void 
   +0x018 RundownRoutine   : Ptr32     void 
   +0x01c NormalRoutine    : Ptr32     void 
   +0x020 NormalContext    : Ptr32 Void
   +0x024 SystemArgument1  : Ptr32 Void
   +0x028 SystemArgument2  : Ptr32 Void
   +0x02c ApcStateIndex    : Char
   +0x02d ApcMode          : Char
   +0x02e Inserted         : UChar
```

```
kd> uf KeInitializeDpc
nt!KeInitializeDpc:
82ae305e 8bff            mov     edi,edi
82ae3060 55              push    ebp
82ae3061 8bec            mov     ebp,esp
82ae3063 8b4508          mov     eax,dword ptr [ebp+8]
82ae3066 33c9            xor     ecx,ecx
82ae3068 83601c00        and     dword ptr [eax+1Ch],0
82ae306c c60013          mov     byte ptr [eax],13h
82ae306f c6400101        mov     byte ptr [eax+1],1
82ae3073 66894802        mov     word ptr [eax+2],cx
82ae3077 8b4d0c          mov     ecx,dword ptr [ebp+0Ch]
82ae307a 89480c          mov     dword ptr [eax+0Ch],ecx
82ae307d 8b4d10          mov     ecx,dword ptr [ebp+10h]
82ae3080 894810          mov     dword ptr [eax+10h],ecx
82ae3083 5d              pop     ebp
82ae3084 c20c00          ret     0Ch
```

```
82ae305e 8bff            mov     edi,edi
//doesn't do anything?

82ae3060 55              push    ebp
82ae3061 8bec            mov     ebp,esp
//setup stack frame

82ae3063 8b4508          mov     eax,dword ptr [ebp+8]
//get first argument
eax = Dpc;

82ae3066 33c9            xor     ecx,ecx
ecx = 0;

82ae3068 83601c00        and     dword ptr [eax+1Ch],0
Dpc->NormalRoutine = NULL;

82ae306c c60013          mov     byte ptr [eax],13h
Dpc->Type = 17;

82ae306f c6400101        mov     byte ptr [eax+1],1
Dpc->SpareByte0 = 1;

82ae3073 66894802        mov     word ptr [eax+2],cx
Dpc->Size = 0x86a8

82ae3077 8b4d0c          mov     ecx,dword ptr [ebp+0Ch] 
//get second argument
ecx = DeferredRoutine;

82ae307a 89480c          mov     dword ptr [eax+0Ch],ecx
Dpc->NormalRoutine = ecx;

82ae307d 8b4d10          mov     ecx,dword ptr [ebp+10h]
//get third argument
ecx = DeferredContext;

82ae3080 894810          mov     dword ptr [eax+10h],ecx
Dpc->NormalContext = ecx;

82ae3083 5d              pop     ebp
82ae3084 c20c00          ret     0Ch
//cleanup stack
```

```C
void __stdcall KeInitializeDpc(PRKDPC Dpc, PKDEFERRED_ROUTINE DeferredRoutine, PVOID DeferredContext)
{
  Dpc->Type = 17;
  Dpc->SpareByte0 = 1;
  Dpc->Size = 0x86a8;
  Dpc->NormalRoutine = DeferredRoutine;
  Dpc->NormalContext = DeferredContext;
}
```

----
