1)

```C
VOID KeInitializeDpc(
  _Out_    PRKDPC             Dpc,
  _In_     PKDEFERRED_ROUTINE DeferredRoutine,
  _In_opt_ PVOID              DeferredContext
);
```

```
kd> dt nt!*APC*
          ntkrpamp!_KAPC
          ntkrpamp!_PSP_CPU_QUOTA_APC
          ntkrpamp!_KAPC_STATE
kd> dt ntkrpamp!_KAPC
   +0x000 Type             : UChar
   +0x001 SpareByte0       : UChar
   +0x002 Size             : UChar
   +0x003 SpareByte1       : UChar
   +0x004 SpareLong0       : Uint4B
   +0x008 Thread           : Ptr32 _KTHREAD
   +0x00c ApcListEntry     : _LIST_ENTRY
   +0x014 KernelRoutine    : Ptr32     void 
   +0x018 RundownRoutine   : Ptr32     void 
   +0x01c NormalRoutine    : Ptr32     void 
   +0x020 NormalContext    : Ptr32 Void
   +0x024 SystemArgument1  : Ptr32 Void
   +0x028 SystemArgument2  : Ptr32 Void
   +0x02c ApcStateIndex    : Char
   +0x02d ApcMode          : Char
   +0x02e Inserted         : UChar
```

```
kd> uf KeInitializeDpc
nt!KeInitializeDpc:
82ae305e 8bff            mov     edi,edi
82ae3060 55              push    ebp
82ae3061 8bec            mov     ebp,esp
82ae3063 8b4508          mov     eax,dword ptr [ebp+8]
82ae3066 33c9            xor     ecx,ecx
82ae3068 83601c00        and     dword ptr [eax+1Ch],0
82ae306c c60013          mov     byte ptr [eax],13h
82ae306f c6400101        mov     byte ptr [eax+1],1
82ae3073 66894802        mov     word ptr [eax+2],cx
82ae3077 8b4d0c          mov     ecx,dword ptr [ebp+0Ch]
82ae307a 89480c          mov     dword ptr [eax+0Ch],ecx
82ae307d 8b4d10          mov     ecx,dword ptr [ebp+10h]
82ae3080 894810          mov     dword ptr [eax+10h],ecx
82ae3083 5d              pop     ebp
82ae3084 c20c00          ret     0Ch
```

```
82ae305e 8bff            mov     edi,edi
//doesn't do anything?

82ae3060 55              push    ebp
82ae3061 8bec            mov     ebp,esp
//setup stack frame

82ae3063 8b4508          mov     eax,dword ptr [ebp+8]
//get first argument
eax = Dpc;

82ae3066 33c9            xor     ecx,ecx
ecx = 0;

82ae3068 83601c00        and     dword ptr [eax+1Ch],0
Dpc->NormalRoutine = NULL;

82ae306c c60013          mov     byte ptr [eax],13h
Dpc->Type = 17;

82ae306f c6400101        mov     byte ptr [eax+1],1
Dpc->SpareByte0 = 1;

82ae3073 66894802        mov     word ptr [eax+2],cx
Dpc->Size = 0x86a8

82ae3077 8b4d0c          mov     ecx,dword ptr [ebp+0Ch] 
//get second argument
ecx = DeferredRoutine;

82ae307a 89480c          mov     dword ptr [eax+0Ch],ecx
Dpc->NormalRoutine = ecx;

82ae307d 8b4d10          mov     ecx,dword ptr [ebp+10h]
//get third argument
ecx = DeferredContext;

82ae3080 894810          mov     dword ptr [eax+10h],ecx
Dpc->NormalContext = ecx;

82ae3083 5d              pop     ebp
82ae3084 c20c00          ret     0Ch
//cleanup stack
```

```C
void __stdcall KeInitializeDpc(PRKDPC Dpc, PKDEFERRED_ROUTINE DeferredRoutine, PVOID DeferredContext)
{
  Dpc->Type = 17;
  Dpc->SpareByte0 = 1;
  Dpc->Size = 0x86a8;
  Dpc->NormalRoutine = DeferredRoutine;
  Dpc->NormalContext = DeferredContext;
}
```

----

2)

http://www.drdobbs.com/inside-nts-asynchronous-procedure-call/184416590?pgno=2
```C
NTKERNELAPI
VOID
KeInitializeApc (
    IN PRKAPC Apc,
    IN PKTHREAD Thread,
    IN KAPC_ENVIRONMENT Environment,
    IN PKKERNEL_ROUTINE KernelRoutine,
    IN PKRUNDOWN_ROUTINE RundownRoutine OPTIONAL,
    IN PKNORMAL_ROUTINE NormalRoutine OPTIONAL,
    IN KPROCESSOR_MODE ApcMode,
    IN PVOID NormalContext
    );

typedef enum _KAPC_ENVIRONMENT {
    OriginalApcEnvironment,
    AttachedApcEnvironment,
    CurrentApcEnvironment
} KAPC_ENVIRONMENT;
```

```
kd> dt ntkrpamp!_KAPC
   +0x000 Type             : UChar
   +0x001 SpareByte0       : UChar
   +0x002 Size             : UChar
   +0x003 SpareByte1       : UChar
   +0x004 SpareLong0       : Uint4B
   +0x008 Thread           : Ptr32 _KTHREAD
   +0x00c ApcListEntry     : _LIST_ENTRY
   +0x014 KernelRoutine    : Ptr32     void 
   +0x018 RundownRoutine   : Ptr32     void 
   +0x01c NormalRoutine    : Ptr32     void 
   +0x020 NormalContext    : Ptr32 Void
   +0x024 SystemArgument1  : Ptr32 Void
   +0x028 SystemArgument2  : Ptr32 Void
   +0x02c ApcStateIndex    : Char
   +0x02d ApcMode          : Char
   +0x02e Inserted         : UChar
kd> dt nt!_KTHREAD
   ...
   +0x134 ApcStateIndex    : UChar
   ...
```

```
kd> uf KeInitializeApc
nt!KeInitializeApc:
82af2134 8bff            mov     edi,edi
82af2136 55              push    ebp
82af2137 8bec            mov     ebp,esp
82af2139 8b4508          mov     eax,dword ptr [ebp+8]
82af213c 8b5510          mov     edx,dword ptr [ebp+10h]
82af213f 8b4d0c          mov     ecx,dword ptr [ebp+0Ch]
82af2142 c60012          mov     byte ptr [eax],12h
82af2145 c6400230        mov     byte ptr [eax+2],30h
82af2149 83fa02          cmp     edx,2
82af214c 7506            jne     nt!KeInitializeApc+0x20 (82af2154)  Branch

nt!KeInitializeApc+0x1a:
82af214e 8a9134010000    mov     dl,byte ptr [ecx+134h]

nt!KeInitializeApc+0x20:
82af2154 894808          mov     dword ptr [eax+8],ecx
82af2157 8b4d14          mov     ecx,dword ptr [ebp+14h]
82af215a 894814          mov     dword ptr [eax+14h],ecx
82af215d 8b4d18          mov     ecx,dword ptr [ebp+18h]
82af2160 88502c          mov     byte ptr [eax+2Ch],dl
82af2163 894818          mov     dword ptr [eax+18h],ecx
82af2166 8b4d1c          mov     ecx,dword ptr [ebp+1Ch]
82af2169 33d2            xor     edx,edx
82af216b 89481c          mov     dword ptr [eax+1Ch],ecx
82af216e 3bca            cmp     ecx,edx
82af2170 740e            je      nt!KeInitializeApc+0x4c (82af2180)  Branch

nt!KeInitializeApc+0x3e:
82af2172 8a4d20          mov     cl,byte ptr [ebp+20h]
82af2175 88482d          mov     byte ptr [eax+2Dh],cl
82af2178 8b4d24          mov     ecx,dword ptr [ebp+24h]
82af217b 894820          mov     dword ptr [eax+20h],ecx
82af217e eb06            jmp     nt!KeInitializeApc+0x52 (82af2186)  Branch

nt!KeInitializeApc+0x4c:
82af2180 88502d          mov     byte ptr [eax+2Dh],dl
82af2183 895020          mov     dword ptr [eax+20h],edx

nt!KeInitializeApc+0x52:
82af2186 88502e          mov     byte ptr [eax+2Eh],dl
82af2189 5d              pop     ebp
82af218a c22000          ret     20h
```

```
  eax = Apc;                           //mov     eax,dword ptr [ebp+8]
  edx = Environment;                   //mov     edx,dword ptr [ebp+10h]
  ecx = Thread;                        //mov     ecx,dword ptr [ebp+0Ch]
  Apc->Type = 0x12;                    //mov     byte ptr [eax],12h
  Apc->Size = 0x30;                    //mov     byte ptr [eax+2],30h
  if(Enironment == 2)                  //cmp     ecx,edx 
                                       //je      nt!KeInitializeApc+0x4c (82af2180)  Branch
  {
    Enironment = Thread->ApcStateIndex;//mov     dl,byte ptr [ecx+134h]
  }
  Apc->Thread = Thread;                //mov     dword ptr [eax+8],ecx
  ecx = KernelRoutine;                 //mov     ecx,dword ptr [ebp+14h]
  Apc->KernelRoutine = KernelRoutine   //mov     dword ptr [eax+14h],ecx
  ecx = RundownRoutine                 //mov     ecx,dword ptr [ebp+18h]
  Apc->ApcStateIndex = Enironment & 0xff; //mov     byte ptr [eax+2Ch],dl
  Apc->RundownRoutine = RundownRoutine;//mov     dword ptr [eax+18h],ecx
  ecx = NormalRoutine                  //mov     ecx,dword ptr [ebp+1Ch]
  edx = 0                              //xor     edx,edx
  Apc->NormalRoutine = NormalRoutine   //mov     dword ptr [eax+1Ch],ecx
  if(NormalRoutine != NULL)            //cmp     ecx,edx
                                       //je      nt!KeInitializeApc+0x4c 
  {
     cl = ApcMode & 0xff               //mov     cl,byte ptr [ebp+20h]
     Apc->ApcMode = ApcMode            //mov     byte ptr [eax+2Dh],cl
     ecx = NormalContext               //mov     ecx,dword ptr [ebp+24h]
     Apc->NormalContext = NormalContext//mov     dword ptr [eax+20h],ecx
  }
  else
  {
    Apc->ApcMode = 0                   //mov     byte ptr [eax+2Dh],dl
    Apc->NormalContext = NULL          //mov     dword ptr [eax+20h],edx
  }
  Apc->Inserted = 0                    //mov     byte ptr [eax+2Eh],dl
```

```C
NTKERNELAPI
VOID
KeInitializeApc (
    IN PRKAPC Apc,
    IN PKTHREAD Thread,
    IN KAPC_ENVIRONMENT Environment,
    IN PKKERNEL_ROUTINE KernelRoutine,
    IN PKRUNDOWN_ROUTINE RundownRoutine OPTIONAL,
    IN PKNORMAL_ROUTINE NormalRoutine OPTIONAL,
    IN KPROCESSOR_MODE ApcMode,
    IN PVOID NormalContext
    )
{
  Apc->Type = 0x12;
  Apc->Size = 0x30;
  if(Enironment == 2)
  {
    Enironment = Thread->ApcStateIndex;
  }
  Apc->Thread = Thread;
  Apc->KernelRoutine = KernelRoutine;
  Apc->ApcStateIndex = Enironment & 0xff;
  Apc->RundownRoutine = RundownRoutine;
  Apc->NormalRoutine = NormalRoutine;
  if(NormalRoutine != NULL)
  {
     Apc->ApcMode = ApcMode;
     Apc->NormalContext = NormalContext;
  }
  else
  {
    Apc->ApcMode = 0;
    Apc->NormalContext = NULL;
  }
  Apc->Inserted = 0;
}
```

----

3)

```C
void __fastcall ObFastDereferenceObject(IN PEX_FAST_REF FastRef, IN PVOID Object);
```

```

```

```
kd> uf ObFastDereferenceObject
nt!ObFastDereferenceObject:
82ac2e9b 8bff            mov     edi,edi
82ac2e9d 55              push    ebp
82ac2e9e 8bec            mov     ebp,esp
82ac2ea0 51              push    ecx
82ac2ea1 8b0a            mov     ecx,dword ptr [edx]
82ac2ea3 56              push    esi
82ac2ea4 57              push    edi
82ac2ea5 8bc1            mov     eax,ecx
82ac2ea7 eb13            jmp     nt!ObFastDereferenceObject+0x21 (82ac2ebc)  Branch

nt!ObFastDereferenceObject+0xe:
82ac2ea9 8d4101          lea     eax,[ecx+1]
82ac2eac 8bf0            mov     esi,eax
82ac2eae 8bfa            mov     edi,edx
82ac2eb0 8bc1            mov     eax,ecx
82ac2eb2 f00fb137        lock cmpxchg dword ptr [edi],esi
82ac2eb6 3bc1            cmp     eax,ecx
82ac2eb8 7412            je      nt!ObFastDereferenceObject+0x31 (82ac2ecc)  Branch

nt!ObFastDereferenceObject+0x1f:
82ac2eba 8bc8            mov     ecx,eax

nt!ObFastDereferenceObject+0x21:
82ac2ebc 334508          xor     eax,dword ptr [ebp+8]
82ac2ebf 83f807          cmp     eax,7
82ac2ec2 72e5            jb      nt!ObFastDereferenceObject+0xe (82ac2ea9)  Branch

nt!ObFastDereferenceObject+0x29:
82ac2ec4 8b4d08          mov     ecx,dword ptr [ebp+8]
82ac2ec7 e89772ffff      call    nt!ObfDereferenceObject (82aba163)

nt!ObFastDereferenceObject+0x31:
82ac2ecc 5f              pop     edi
82ac2ecd 5e              pop     esi
82ac2ece 59              pop     ecx
82ac2ecf 5d              pop     ebp
82ac2ed0 c20400          ret     4
```

```
  
```

```C
void __fastcall ObFastDereferenceObject(IN PEX_FAST_REF FastRef, IN PVOID Object)
{
  
}
```

----


